name: "D4"

input: "data"
input_shape {
    dim: 1
    dim: 3
    dim: 410
    dim: 800
}

input: "im_info"
input_shape {
    dim: 1
    dim: 3
}

layer {
  name: "conv1"
  type: "ConvolutionData"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv1_bn"
  type: "BNData"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2"
  type: "ConvolutionData"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv2_bn"
  type: "BNData"
  bottom: "conv2"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv2_relu"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2a1"
  type: "ConvolutionData"
  bottom: "pool2"
  top: "conv2a1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv2a1_bn"
  type: "BNData"
  bottom: "conv2a1"
  top: "conv2a1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv2a1_relu"
  type: "ReLU"
  bottom: "conv2a1"
  top: "conv2a1"
}
layer {
  name: "conv2a2"
  type: "ConvolutionData"
  bottom: "conv2a1"
  top: "conv2a2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv2a2_bn"
  type: "BNData"
  bottom: "conv2a2"
  top: "conv2a2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv2a2_relu"
  type: "ReLU"
  bottom: "conv2a2"
  top: "conv2a2"
}
layer {
  name: "conv2a3"
  type: "ConvolutionData"
  bottom: "conv2a2"
  top: "conv2a3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv2a3_bn"
  type: "BNData"
  bottom: "conv2a3"
  top: "conv2a3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv2a3_relu"
  type: "ReLU"
  bottom: "conv2a3"
  top: "conv2a3"
}
layer {
  name: "conv2a4"
  type: "ConvolutionData"
  bottom: "conv2a3"
  top: "conv2a4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv2a4_bn"
  type: "BNData"
  bottom: "conv2a4"
  top: "conv2a4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv2a4_relu"
  type: "ReLU"
  bottom: "conv2a4"
  top: "conv2a4"
}
layer {
  name: "2a/output"
  type: "Concat"
  bottom: "conv2a1"
  bottom: "conv2a2"
  bottom: "conv2a3"
  bottom: "conv2a4"
  top: "2a/output"
}
layer {
  name: "conv2b1"
  type: "ConvolutionData"
  bottom: "2a/output"
  top: "conv2b1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv2b1_bn"
  type: "BNData"
  bottom: "conv2b1"
  top: "conv2b1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv2b1_relu"
  type: "ReLU"
  bottom: "conv2b1"
  top: "conv2b1"
}
layer {
  name: "conv2b2"
  type: "ConvolutionData"
  bottom: "conv2b1"
  top: "conv2b2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv2b2_bn"
  type: "BNData"
  bottom: "conv2b2"
  top: "conv2b2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv2b2_relu"
  type: "ReLU"
  bottom: "conv2b2"
  top: "conv2b2"
}
layer {
  name: "conv2b3"
  type: "ConvolutionData"
  bottom: "conv2b2"
  top: "conv2b3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv2b3_bn"
  type: "BNData"
  bottom: "conv2b3"
  top: "conv2b3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv2b3_relu"
  type: "ReLU"
  bottom: "conv2b3"
  top: "conv2b3"
}
layer {
  name: "conv2b4"
  type: "ConvolutionData"
  bottom: "conv2b3"
  top: "conv2b4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv2b4_bn"
  type: "BNData"
  bottom: "conv2b4"
  top: "conv2b4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv2b4_relu"
  type: "ReLU"
  bottom: "conv2b4"
  top: "conv2b4"
}
layer {
  name: "2b/output"
  type: "Concat"
  bottom: "conv2b1"
  bottom: "conv2b2"
  bottom: "conv2b3"
  bottom: "conv2b4"
  top: "2b/output"
}
layer {
  name: "conv3"
  type: "ConvolutionData"
  bottom: "2b/output"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3_bn"
  type: "BNData"
  bottom: "conv3"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3_relu"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3a1"
  type: "ConvolutionData"
  bottom: "pool3"
  top: "conv3a1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3a1_bn"
  type: "BNData"
  bottom: "conv3a1"
  top: "conv3a1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3a1_relu"
  type: "ReLU"
  bottom: "conv3a1"
  top: "conv3a1"
}
layer {
  name: "conv3a2"
  type: "ConvolutionData"
  bottom: "conv3a1"
  top: "conv3a2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3a2_bn"
  type: "BNData"
  bottom: "conv3a2"
  top: "conv3a2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3a2_relu"
  type: "ReLU"
  bottom: "conv3a2"
  top: "conv3a2"
}
layer {
  name: "conv3a3"
  type: "ConvolutionData"
  bottom: "conv3a2"
  top: "conv3a3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3a3_bn"
  type: "BNData"
  bottom: "conv3a3"
  top: "conv3a3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3a3_relu"
  type: "ReLU"
  bottom: "conv3a3"
  top: "conv3a3"
}
layer {
  name: "conv3a4"
  type: "ConvolutionData"
  bottom: "conv3a3"
  top: "conv3a4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3a4_bn"
  type: "BNData"
  bottom: "conv3a4"
  top: "conv3a4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3a4_relu"
  type: "ReLU"
  bottom: "conv3a4"
  top: "conv3a4"
}
layer {
  name: "3a/output"
  type: "Concat"
  bottom: "conv3a1"
  bottom: "conv3a2"
  bottom: "conv3a3"
  bottom: "conv3a4"
  top: "3a/output"
}
layer {
  name: "conv3b1"
  type: "ConvolutionData"
  bottom: "3a/output"
  top: "conv3b1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3b1_bn"
  type: "BNData"
  bottom: "conv3b1"
  top: "conv3b1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3b1_relu"
  type: "ReLU"
  bottom: "conv3b1"
  top: "conv3b1"
}
layer {
  name: "conv3b2"
  type: "ConvolutionData"
  bottom: "conv3b1"
  top: "conv3b2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3b2_bn"
  type: "BNData"
  bottom: "conv3b2"
  top: "conv3b2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3b2_relu"
  type: "ReLU"
  bottom: "conv3b2"
  top: "conv3b2"
}
layer {
  name: "conv3b3"
  type: "ConvolutionData"
  bottom: "conv3b2"
  top: "conv3b3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3b3_bn"
  type: "BNData"
  bottom: "conv3b3"
  top: "conv3b3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3b3_relu"
  type: "ReLU"
  bottom: "conv3b3"
  top: "conv3b3"
}
layer {
  name: "conv3b4"
  type: "ConvolutionData"
  bottom: "conv3b3"
  top: "conv3b4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3b4_bn"
  type: "BNData"
  bottom: "conv3b4"
  top: "conv3b4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3b4_relu"
  type: "ReLU"
  bottom: "conv3b4"
  top: "conv3b4"
}
layer {
  name: "3b/output"
  type: "Concat"
  bottom: "conv3b1"
  bottom: "conv3b2"
  bottom: "conv3b3"
  bottom: "conv3b4"
  top: "3b/output"
}
layer {
  name: "conv3c1"
  type: "ConvolutionData"
  bottom: "3b/output"
  top: "conv3c1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3c1_bn"
  type: "BNData"
  bottom: "conv3c1"
  top: "conv3c1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3c1_relu"
  type: "ReLU"
  bottom: "conv3c1"
  top: "conv3c1"
}
layer {
  name: "conv3c2"
  type: "ConvolutionData"
  bottom: "conv3c1"
  top: "conv3c2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3c2_bn"
  type: "BNData"
  bottom: "conv3c2"
  top: "conv3c2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3c2_relu"
  type: "ReLU"
  bottom: "conv3c2"
  top: "conv3c2"
}
layer {
  name: "conv3c3"
  type: "ConvolutionData"
  bottom: "conv3c2"
  top: "conv3c3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3c3_bn"
  type: "BNData"
  bottom: "conv3c3"
  top: "conv3c3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3c3_relu"
  type: "ReLU"
  bottom: "conv3c3"
  top: "conv3c3"
}
layer {
  name: "conv3c4"
  type: "ConvolutionData"
  bottom: "conv3c3"
  top: "conv3c4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv3c4_bn"
  type: "BNData"
  bottom: "conv3c4"
  top: "conv3c4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv3c4_relu"
  type: "ReLU"
  bottom: "conv3c4"
  top: "conv3c4"
}
layer {
  name: "3c/output"
  type: "Concat"
  bottom: "conv3c1"
  bottom: "conv3c2"
  bottom: "conv3c3"
  bottom: "conv3c4"
  top: "3c/output"
}
layer {
  name: "conv4"
  type: "ConvolutionData"
  bottom: "3c/output"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4_bn"
  type: "BNData"
  bottom: "conv4"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4_relu"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4a1"
  type: "ConvolutionData"
  bottom: "pool4"
  top: "conv4a1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4a1_bn"
  type: "BNData"
  bottom: "conv4a1"
  top: "conv4a1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4a1_relu"
  type: "ReLU"
  bottom: "conv4a1"
  top: "conv4a1"
}
layer {
  name: "conv4a2"
  type: "ConvolutionData"
  bottom: "conv4a1"
  top: "conv4a2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4a2_bn"
  type: "BNData"
  bottom: "conv4a2"
  top: "conv4a2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4a2_relu"
  type: "ReLU"
  bottom: "conv4a2"
  top: "conv4a2"
}
layer {
  name: "conv4a3"
  type: "ConvolutionData"
  bottom: "conv4a2"
  top: "conv4a3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4a3_bn"
  type: "BNData"
  bottom: "conv4a3"
  top: "conv4a3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4a3_relu"
  type: "ReLU"
  bottom: "conv4a3"
  top: "conv4a3"
}
layer {
  name: "conv4a4"
  type: "ConvolutionData"
  bottom: "conv4a3"
  top: "conv4a4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4a4_bn"
  type: "BNData"
  bottom: "conv4a4"
  top: "conv4a4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4a4_relu"
  type: "ReLU"
  bottom: "conv4a4"
  top: "conv4a4"
}
layer {
  name: "4a/output"
  type: "Concat"
  bottom: "conv4a1"
  bottom: "conv4a2"
  bottom: "conv4a3"
  bottom: "conv4a4"
  top: "4a/output"
}
layer {
  name: "conv4b1"
  type: "ConvolutionData"
  bottom: "4a/output"
  top: "conv4b1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4b1_bn"
  type: "BNData"
  bottom: "conv4b1"
  top: "conv4b1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4b1_relu"
  type: "ReLU"
  bottom: "conv4b1"
  top: "conv4b1"
}
layer {
  name: "conv4b2"
  type: "ConvolutionData"
  bottom: "conv4b1"
  top: "conv4b2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4b2_bn"
  type: "BNData"
  bottom: "conv4b2"
  top: "conv4b2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4b2_relu"
  type: "ReLU"
  bottom: "conv4b2"
  top: "conv4b2"
}
layer {
  name: "conv4b3"
  type: "ConvolutionData"
  bottom: "conv4b2"
  top: "conv4b3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4b3_bn"
  type: "BNData"
  bottom: "conv4b3"
  top: "conv4b3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4b3_relu"
  type: "ReLU"
  bottom: "conv4b3"
  top: "conv4b3"
}
layer {
  name: "conv4b4"
  type: "ConvolutionData"
  bottom: "conv4b3"
  top: "conv4b4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4b4_bn"
  type: "BNData"
  bottom: "conv4b4"
  top: "conv4b4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4b4_relu"
  type: "ReLU"
  bottom: "conv4b4"
  top: "conv4b4"
}
layer {
  name: "4b/output"
  type: "Concat"
  bottom: "conv4b1"
  bottom: "conv4b2"
  bottom: "conv4b3"
  bottom: "conv4b4"
  top: "4b/output"
}
layer {
  name: "conv4c1"
  type: "ConvolutionData"
  bottom: "4b/output"
  top: "conv4c1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4c1_bn"
  type: "BNData"
  bottom: "conv4c1"
  top: "conv4c1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4c1_relu"
  type: "ReLU"
  bottom: "conv4c1"
  top: "conv4c1"
}
layer {
  name: "conv4c2"
  type: "ConvolutionData"
  bottom: "conv4c1"
  top: "conv4c2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4c2_bn"
  type: "BNData"
  bottom: "conv4c2"
  top: "conv4c2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4c2_relu"
  type: "ReLU"
  bottom: "conv4c2"
  top: "conv4c2"
}
layer {
  name: "conv4c3"
  type: "ConvolutionData"
  bottom: "conv4c2"
  top: "conv4c3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4c3_bn"
  type: "BNData"
  bottom: "conv4c3"
  top: "conv4c3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4c3_relu"
  type: "ReLU"
  bottom: "conv4c3"
  top: "conv4c3"
}
layer {
  name: "conv4c4"
  type: "ConvolutionData"
  bottom: "conv4c3"
  top: "conv4c4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4c4_bn"
  type: "BNData"
  bottom: "conv4c4"
  top: "conv4c4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4c4_relu"
  type: "ReLU"
  bottom: "conv4c4"
  top: "conv4c4"
}
layer {
  name: "4c/output"
  type: "Concat"
  bottom: "conv4c1"
  bottom: "conv4c2"
  bottom: "conv4c3"
  bottom: "conv4c4"
  top: "4c/output"
}
layer {
  name: "conv4d1"
  type: "ConvolutionData"
  bottom: "4c/output"
  top: "conv4d1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4d1_bn"
  type: "BNData"
  bottom: "conv4d1"
  top: "conv4d1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4d1_relu"
  type: "ReLU"
  bottom: "conv4d1"
  top: "conv4d1"
}
layer {
  name: "conv4d2"
  type: "ConvolutionData"
  bottom: "conv4d1"
  top: "conv4d2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4d2_bn"
  type: "BNData"
  bottom: "conv4d2"
  top: "conv4d2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4d2_relu"
  type: "ReLU"
  bottom: "conv4d2"
  top: "conv4d2"
}
layer {
  name: "conv4d3"
  type: "ConvolutionData"
  bottom: "conv4d2"
  top: "conv4d3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4d3_bn"
  type: "BNData"
  bottom: "conv4d3"
  top: "conv4d3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4d3_relu"
  type: "ReLU"
  bottom: "conv4d3"
  top: "conv4d3"
}
layer {
  name: "conv4d4"
  type: "ConvolutionData"
  bottom: "conv4d3"
  top: "conv4d4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv4d4_bn"
  type: "BNData"
  bottom: "conv4d4"
  top: "conv4d4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv4d4_relu"
  type: "ReLU"
  bottom: "conv4d4"
  top: "conv4d4"
}
layer {
  name: "4d/output"
  type: "Concat"
  bottom: "conv4d1"
  bottom: "conv4d2"
  bottom: "conv4d3"
  bottom: "conv4d4"
  top: "4d/output"
}
layer {
  name: "conv5"
  type: "ConvolutionData"
  bottom: "4d/output"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "conv5_bn"
  type: "BNData"
  bottom: "conv5"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.05
    multigpu_sync: ALL
  }
}
layer {
  name: "conv5_relu"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
############################ RPN ############################
layer {
  name: "rpn_feat"
  type: "ConvolutionData"
  bottom: "conv5"
  top: "rpn_feat"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layer {
  name: "rpn_feat_bn"
  type: "BNData"
  bottom: "rpn_feat"
  top: "rpn_feat"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.1
    multigpu_sync: ALL
  }
}
layer {
  name: "rpn_feat_relu"
  type: "ReLU"
  bottom: "rpn_feat"
  top: "rpn_feat"
}
layer {
  name: "rpn_cls_score"
  type: "ConvolutionData"
  bottom: "rpn_feat"
  top: "rpn_cls_score"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "rpn_bbox_pred"
  type: "ConvolutionData"
  bottom: "rpn_feat"
  top: "rpn_bbox_pred"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "rpn_cls_score_reshape"
  type: "Reshape"
  bottom: "rpn_cls_score"
  top: "rpn_cls_score_reshape"
  reshape_param {
    shape {
      dim: 0
      dim: 2
      dim: -1
      dim: 0
    }
  }
}
layer {
  name: "rpn_cls_prob"
  type: "Softmax"
  bottom: "rpn_cls_score_reshape"
  top: "rpn_cls_prob"
}
layer {
  name: "rpn_cls_prob_reshape"
  type: "Reshape"
  bottom: "rpn_cls_prob"
  top: "rpn_cls_prob_reshape"
  reshape_param {
    shape {
      dim: 0
      dim: 48
      dim: -1
      dim: 0
    }
  }
}
layer {
  name: "proposal"
  type: "RpnProposal"
  bottom: "rpn_cls_prob_reshape"
  bottom: "rpn_bbox_pred"
  bottom: "im_info"
  top: "rois"
  top: "anchors_id"
  top: "rois_score"
  propagate_down: false
  propagate_down: false
  propagate_down: false
  rpn_proposal_param {
    feat_stride: 16
  }
}
############################ FRCNN ############################
layer {
  name: "cls_bbox_feat"
  type: "ConvolutionData"
  bottom: "conv5"
  top: "cls_bbox_feat"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layer {
  name: "cls_bbox_feat_bn"
  type: "BNData"
  bottom: "cls_bbox_feat"
  top: "cls_bbox_feat"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0
    }
    decay: 0.1
    multigpu_sync: ALL
  }
}
layer {
  name: "cls_bbox_feat_relu"
  type: "ReLU"
  bottom: "cls_bbox_feat"
  top: "cls_bbox_feat"
}
layer {
  name: "cls_feat"
  type: "ConvolutionData"
  bottom: "cls_bbox_feat"
  top: "cls_feat"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 98
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "cls_vote"
  type: "PSROIMaskPooling"
  bottom: "cls_feat"
  bottom: "rois"
  top: "cls_vote"
  psroi_mask_pooling_param {
    spatial_scale: 0.0625
    output_dim: 2
    group_size: 7
    roi_scale: 1.5
  }
}
layer {
  name: "cls_score"
  type: "Pooling"
  bottom: "cls_vote"
  top: "cls_score"
  pooling_param {
    pool: AVE
    kernel_size: 7
  }
}
layer {
  name: "bbox_feat"
  type: "ConvolutionData"
  bottom: "cls_bbox_feat"
  top: "bbox_feat"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 196
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bbox_vote"
  type: "PSROIMaskPooling"
  bottom: "bbox_feat"
  bottom: "rois"
  top: "bbox_vote"
  psroi_mask_pooling_param {
    spatial_scale: 0.0625
    output_dim: 4
    group_size: 7
    roi_scale: 1.5
  }
}
layer {
  name: "bbox_pred"
  type: "Pooling"
  bottom: "bbox_vote"
  top: "bbox_pred"
  pooling_param {
    pool: AVE
    kernel_size: 7
  }
}
layer {
  name: "cls_prob"
  type: "Softmax"
  bottom: "cls_score"
  top: "cls_prob"
}
